summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_JPE_STATUS_IMR.
* To use register names with standard convension, please use CIF_JPE_STATUS_IMR.
*/
#define	CIFJPE_STATUS_IMR	(CIF_JPE_STATUS_IMR)

/** \\brief  198C, JPEG Status Interrupt Set Register */
#define CIF_JPE_STATUS_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_ISR*)0xF90E388Cu)

/** Alias (User Manual Name) for CIF_JPE_STATUS_ISR.
* To use register names with standard convension, please use CIF_JPE_STATUS_ISR.
*/
#define	CIFJPE_STATUS_ISR	(CIF_JPE_STATUS_ISR)

/** \\brief  1984, JPEG Status Masked Interrupt Status Register */
#define CIF_JPE_STATUS_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_MIS*)0xF90E3884u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_MIS.
* To use register names with standard convension, please use CIF_JPE_STATUS_MIS.
*/
#define	CIFJPE_STATUS_MIS	(CIF_JPE_STATUS_MIS)

/** \\brief  1980, JPEG Status Raw Interrupt Status Register */
#define CIF_JPE_STATUS_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_STATUS_RIS*)0xF90E3880u)

/** Alias (User Manual Name) for CIF_JPE_STATUS_RIS.
* To use register names with standard convension, please use CIF_JPE_STATUS_RIS.
*/
#define	CIFJPE_STATUS_RIS	(CIF_JPE_STATUS_RIS)

/** \\brief  193C, JPE Table Programming Register */
#define CIF_JPE_TABLE_DATA /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_DATA*)0xF90E383Cu)

/** Alias (User Manual Name) for CIF_JPE_TABLE_DATA.
* To use register names with standard convension, please use CIF_JPE_TABLE_DATA.
*/
#define	CIFJPE_TABLE_DATA	(CIF_JPE_TABLE_DATA)

/** \\brief  1914, JPE Header Generation Debug Register */
#define CIF_JPE_TABLE_FLUSH /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_FLUSH*)0xF90E3814u)

/** Alias (User Manual Name) for CIF_JPE_TABLE_FLUSH.
* To use register names with standard convension, please use CIF_JPE_TABLE_FLUSH.
*/
#define	CIFJPE_TABLE_FLUSH	(CIF_JPE_TABLE_FLUSH)

/** \\brief  1940, JPE Table Programming Select Register */
#define CIF_JPE_TABLE_ID /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TABLE_ID*)0xF90E3840u)

/** Alias (User Manual Name) for CIF_JPE_TABLE_ID.
* To use register names with standard convension, please use CIF_JPE_TABLE_ID.
*/
#define	CIFJPE_TABLE_ID	(CIF_JPE_TABLE_ID)

/** \\brief  1944, JPE Huffman AC Table 0 Length Register */
#define CIF_JPE_TAC0_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TAC0_LEN*)0xF90E3844u)

/** Alias (User Manual Name) for CIF_JPE_TAC0_LEN.
* To use register names with standard convension, please use CIF_JPE_TAC0_LEN.
*/
#define	CIFJPE_TAC0_LEN	(CIF_JPE_TAC0_LEN)

/** \\brief  194C, JPE Huffman AC Table 1 Length Register */
#define CIF_JPE_TAC1_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TAC1_LEN*)0xF90E384Cu)

/** Alias (User Manual Name) for CIF_JPE_TAC1_LEN.
* To use register names with standard convension, please use CIF_JPE_TAC1_LEN.
*/
#define	CIFJPE_TAC1_LEN	(CIF_JPE_TAC1_LEN)

/** \\brief  1948, JPE Huffman DC Table 0 Length Register */
#define CIF_JPE_TDC0_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TDC0_LEN*)0xF90E3848u)

/** Alias (User Manual Name) for CIF_JPE_TDC0_LEN.
* To use register names with standard convension, please use CIF_JPE_TDC0_LEN.
*/
#define	CIFJPE_TDC0_LEN	(CIF_JPE_TDC0_LEN)

/** \\brief  1950, JPE Huffman DC Table 1 Length Register */
#define CIF_JPE_TDC1_LEN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TDC1_LEN*)0xF90E3850u)

/** Alias (User Manual Name) for CIF_JPE_TDC1_LEN.
* To use register names with standard convension, please use CIF_JPE_TDC1_LEN.
*/
#define	CIFJPE_TDC1_LEN	(CIF_JPE_TDC1_LEN)

/** \\brief  192C, Q- table Selector 1, Quant. Table For U Component */
#define CIF_JPE_TQ_U_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_U_SELECT*)0xF90E382Cu)

/** Alias (User Manual Name) for CIF_JPE_TQ_U_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_U_SELECT.
*/
#define	CIFJPE_TQ_U_SELECT	(CIF_JPE_TQ_U_SELECT)

/** \\brief  1930, Q- table Selector 2 Quant Table For V Component */
#define CIF_JPE_TQ_V_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_V_SELECT*)0xF90E3830u)

/** Alias (User Manual Name) for CIF_JPE_TQ_V_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_V_SELECT.
*/
#define	CIFJPE_TQ_V_SELECT	(CIF_JPE_TQ_V_SELECT)

/** \\brief  1928, Q- table Selector 0 Quant Table For Y Component */
#define CIF_JPE_TQ_Y_SELECT /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_TQ_Y_SELECT*)0xF90E3828u)

/** Alias (User Manual Name) for CIF_JPE_TQ_Y_SELECT.
* To use register names with standard convension, please use CIF_JPE_TQ_Y_SELECT.
*/
#define	CIFJPE_TQ_Y_SELECT	(CIF_JPE_TQ_Y_SELECT)

/** \\brief  190C, JPE Y Value Scaling Control Register */
#define CIF_JPE_Y_SCALE_EN /*lint --e(923)*/ (*(volatile Ifx_CIF_JPE_Y_SCALE_EN*)0xF90E380Cu)

/** Alias (User Manual Name) for CIF_JPE_Y_SCALE_EN.
* To use register names with standard convension, please use CIF_JPE_Y_SCALE_EN.
*/
#define	CIFJPE_Y_SCALE_EN	(CIF_JPE_Y_SCALE_EN)

/** \\brief  2600, Linear Downscaler Control Register */
#define CIF_LDS_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_CTRL*)0xF90E4500u)

/** Alias (User Manual Name) for CIF_LDS_CTRL.
* To use register names with standard convension, please use CIF_LDS_CTRL.
*/
#define	CIFLDS_CTRL	(CIF_LDS_CTRL)

/** \\brief  2604, Linear Downscaler Factor Register */
#define CIF_LDS_FAC /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_FAC*)0xF90E4504u)

/** Alias (User Manual Name) for CIF_LDS_FAC.
* To use register names with standard convension, please use CIF_LDS_FAC.
*/
#define	CIFLDS_FAC	(CIF_LDS_FAC)

/** \\brief  1570, Memory Interface Counter Value of JPEG or RAW Data Bytes
 * Register */
#define CIF_MI_BYTE_CNT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_BYTE_CNT*)0xF90E3470u)

/** Alias (User Manual Name) for CIF_MI_BYTE_CNT.
* To use register names with standard convension, please use CIF_MI_BYTE_CNT.
*/
#define	CIFMI_BYTE_CNT	(CIF_MI_BYTE_CNT)

/** \\brief  1500, Memory Interface Global Control Register */
#define CIF_MI_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_CTRL*)0xF90E3400u)

