summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_CTRL_SHD.
*/
#define	CIFMIEP_5_CTRL_SHD	(CIF_MIEP_CH_1S4_CTRL_SHD)

/** \\brief  3A04, Memory Interface Extra Path Control Register For Address Init
 * And Skip Function Register */
#define CIF_MIEP_CH_1S4_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_INIT*)0xF90E5904u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_INIT.
*/
#define	CIFMIEP_5_INIT	(CIF_MIEP_CH_1S4_INIT)

/** \\brief  3A18, Memory Interface Fill Level Interrupt Offset Value For Extra
 * Path Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT*)0xF90E5918u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_INIT.
*/
#define	CIFMIEP_5_IRQ_OFFS_INIT	(CIF_MIEP_CH_1S4_IRQ_OFFS_INIT)

/** \\brief  3A2C, Memory Interface Shadow Register of Fill Level Interrupt
 * Offset Value For Extra Path Register */
#define CIF_MIEP_CH_1S4_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD*)0xF90E592Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_IRQ_OFFS_SHD.
*/
#define	CIFMIEP_5_IRQ_OFFS_SHD	(CIF_MIEP_CH_1S4_IRQ_OFFS_SHD)

/** \\brief  3A10, Memory Interface Offset Counter Init Value For Extra Path
 * Buffer Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_INIT*)0xF90E5910u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_INIT.
*/
#define	CIFMIEP_5_OFFS_CNT_INIT	(CIF_MIEP_CH_1S4_OFFS_CNT_INIT)

/** \\brief  3A28, Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_SHD*)0xF90E5928u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_SHD.
*/
#define	CIFMIEP_5_OFFS_CNT_SHD	(CIF_MIEP_CH_1S4_OFFS_CNT_SHD)

/** \\brief  3A14, Memory Interface Offset Counter Start Value For Extra Path
 * Register */
#define CIF_MIEP_CH_1S4_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_OFFS_CNT_START*)0xF90E5914u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_OFFS_CNT_START.
*/
#define	CIFMIEP_5_OFFS_CNT_START	(CIF_MIEP_CH_1S4_OFFS_CNT_START)

/** \\brief  3A0C, Memory Interface Size of Extra Path Data Buffer Register */
#define CIF_MIEP_CH_1S4_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_INIT*)0xF90E590Cu)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_INIT.
*/
#define	CIFMIEP_5_SIZE_INIT	(CIF_MIEP_CH_1S4_SIZE_INIT)

/** \\brief  3A24, Memory Interface Size Shadow Register of Extra Path Buffer
 * Register */
#define CIF_MIEP_CH_1S4_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_SIZE_SHD*)0xF90E5924u)

/** Alias (User Manual Name) for CIF_MIEP_CH_1S4_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S4_SIZE_SHD.
*/
#define	CIFMIEP_5_SIZE_SHD	(CIF_MIEP_CH_1S4_SIZE_SHD)

/** \\brief  3514, MI Extra Path Interrupt Clear Register */
#define CIF_MIEP_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_ICR*)0xF90E5414u)

/** Alias (User Manual Name) for CIF_MIEP_ICR.
* To use register names with standard convension, please use CIF_MIEP_ICR.
*/
#define	CIFMIEP_ICR	(CIF_MIEP_ICR)

/** \\brief  3508, MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’:
 * interrupt masked */
#define CIF_MIEP_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_IMSC*)0xF90E5408u)

/** Alias (User Manual Name) for CIF_MIEP_IMSC.
* To use register names with standard convension, please use CIF_MIEP_IMSC.
*/
#define	CIFMIEP_IMSC	(CIF_MIEP_IMSC)

/** \\brief  3518, MI Extra Path Interrupt Set Register */
#define CIF_MIEP_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_ISR*)0xF90E5418u)

/** Alias (User Manual Name) for CIF_MIEP_ISR.
* To use register names with standard convension, please use CIF_MIEP_ISR.
*/
#define	CIFMIEP_ISR	(CIF_MIEP_ISR)

/** \\brief  3510, MI Extra Path Masked Interrupt Status Register */
#define CIF_MIEP_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_MIS*)0xF90E5410u)

/** Alias (User Manual Name) for CIF_MIEP_MIS.
* To use register names with standard convension, please use CIF_MIEP_MIS.
*/
#define	CIFMIEP_MIS	(CIF_MIEP_MIS)

/** \\brief  350C, MI Extra Path Raw Interrupt Status Register */
#define CIF_MIEP_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_RIS*)0xF90E540Cu)

/** Alias (User Manual Name) for CIF_MIEP_RIS.
* To use register names with standard convension, please use CIF_MIEP_RIS.
*/
#define	CIFMIEP_RIS	(CIF_MIEP_RIS)

/** \\brief  3500, Extra Path Error Register */
#define CIF_MIEP_STA_ERR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR*)0xF90E5400u)

/** Alias (User Manual Name) for CIF_MIEP_STA_ERR.
* To use register names with standard convension, please use CIF_MIEP_STA_ERR.
*/
#define	CIFMIEP_STA_ERR	(CIF_MIEP_STA_ERR)

/** \\brief  3504, Extra Path Error Clear Register */
#define CIF_MIEP_STA_ERR_CLR /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_STA_ERR_CLR*)0xF90E5404u)

/** Alias (User Manual Name) for CIF_MIEP_STA_ERR_CLR.
* To use register names with standard convension, please use CIF_MIEP_STA_ERR_CLR.
*/
#define	CIFMIEP_STA_ERR_CLR	(CIF_MIEP_STA_ERR_CLR)

/** \\brief  2500, Watchdog Control Register */
#define CIF_WD_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_CTRL*)0xF90E4400u)

/** Alias (User Manual Name) for CIF_WD_CTRL.
* To use register names with standard convension, please use CIF_WD_CTRL.
*/
#define	CIFWD_CTRL	(CIF_WD_CTRL)

